app/views/posts/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 7], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 7]]
---
<h3>Comments</h3>
<% if @post.comments.any? %>