app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "afa"], ["post_id", 7], ["created_at", "2020-12-27 14:37:29.196523"], ["updated_at", "2020-12-27 14:37:29.196523"]]