app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: 'desc')
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    # render plain: params[:post].inspect
    # save
    # @post = Post.new(params.require(:post).permit(:title, :body))
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "b"], ["created_at", "2020-12-27 10:46:10.550532"], ["updated_at", "2020-12-27 10:46:10.550532"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "aaaaaa"], ["body", "aaaaaaaaa\r\naaa"], ["updated_at", "2020-12-27 12:41:02.319405"], ["id", 10]]